// Модальное окно
var  a = prompt("Введите пароль");
// Выводит ответ : "доступны модули A, B и C" , если ввести комбинацию чисел 9583 в модальное окно
if (a == 9583){
	document.write ("доступны модули A, B и C")
}
// Выводит ответ : "доступны модули A, B и C" , если ввести комбинацию чисел 1747 в модальное окно
if (a == 1747){
	document.write ("доступны модули A, B и C")
} 
// Выводит ответ : "доступны модули B и C" , если ввести комбинацию чисел 3331 в модальное окно
if (a == 3331){
	document.write ("доступны модули B и C")
}
// Выводит ответ : "доступны модули B и C" , если ввести комбинацию чисел 7922 в модальное окно
if (a == 7922){ 
	document.write ("доступны модули B и C")
}
// Выводит ответ : "доступны модули C" , если ввести комбинацию чисел 9455 в модальное окно
if (a == 9455){
	document.write ("доступны модули C")
}
// Выводит ответ : "доступны модули C" , если ввести комбинацию чисел 8997 в модальное окно
if (a == 8997){
	document.write ("доступны модули C")
}